# Using MySQL with SQL Alchemy in python

In [9]:
from datetime import datetime as dt

import numpy as np
import pandas as pd

import sqlalchemy

## Raw Connection to DataBase

### Creating engine

In [14]:
coonection_string = 'mysql+pymysql://root:root@localhost:3306/sample'
engine = sqlalchemy.create_engine(coonection_string)

#### Pandas `read_sql_table`

In [16]:
df = pd.read_sql_table('countries', engine)
df.head()

  country_id country_name  region_id
0         AR    Argentina          2
1         AU    Australia          3
2         BE      Belgium          1
3         BR       Brazil          2
4         CA       Canada          2

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  datetime64[ns]
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(3)
memory usage: 13.7+ MB

#### Pandas `read_sql_query`

In [17]:
query = '''
SELECT 
    employee_id, salary
FROM
    employees
WHERE
    salary < 3000;-- employees with low salary
'''

In [18]:
df = pd.read_sql_query(query, engine)
df = df.loc[:,~df.columns.duplicated()].copy()
df.head()

   employee_id  salary
0          116  2900.0
1          117  2800.0
2          118  2600.0
3          119  2500.0
4          126  2700.0

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4853 entries, 0 to 4852
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      4853 non-null   int64
 1   birth_date  4853 non-null   object
 2   first_name  4853 non-null   object
 3   last_name   4853 non-null   object
 4   gender      4853 non-null   object
 5   hire_date   4853 non-null   object
 6   salary      4853 non-null   int64
 7   from_date   4853 non-null   object
 8   to_date     4853 non-null   object
dtypes: int64(2), object(7)
memory usage: 341.4+ KB

### Pandas `read_sql`

In [89]:
df = pd.read_sql(query, engine)
df = df.loc[:,~df.columns.duplicated()].copy()
df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date
0,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,44276,1999-04-30,2000-04-29
1,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,46946,2000-04-29,2001-04-29
2,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,46775,2001-04-29,2002-04-29
3,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,50032,2002-04-29,9999-01-01
4,10105,1962-02-05,Hironoby,Piveteau,M,1999-03-23,59258,1999-05-17,2000-05-16

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4853 entries, 0 to 4852
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      4853 non-null   int64
 1   birth_date  4853 non-null   object
 2   first_name  4853 non-null   object
 3   last_name   4853 non-null   object
 4   gender      4853 non-null   object
 5   hire_date   4853 non-null   object
 6   salary      4853 non-null   int64
 7   from_date   4853 non-null   object
 8   to_date     4853 non-null   object
dtypes: int64(2), object(7)
memory usage: 341.4+ KB

## Writting to DataBase

In [91]:
columns_filter = [
    'emp_no',
    #'birth_date',
    'first_name',
    'last_name',
    #'gender',
    #'hire_date',
    #'emp_no',
    #'salary',
    #'from_date',
    #'to_date'
]

In [92]:
max_salary = df.groupby(columns_filter).agg({'salary' : 'max'}).reset_index()
max_salary.head()

   emp_no first_name last_name  salary
0   10019    Lillian   Haddadi   50032
1   10105   Hironoby  Piveteau   61514
2   10298   Dietrich   DuCasse   43923
3   10684      Aimee  Tokunaga   47683
4   11315      Neven   Meriste   85452

In [93]:
max_salary.to_sql('max_salary', engine)

1521

In [94]:
max_salary.to_sql('max_salary', engine, if_exists='replace')

1521

In [95]:
max_salary_2 = pd.read_sql('SELECT * FROM max_salary', engine)
max_salary_2.head()

   index  emp_no first_name last_name  salary
0      0   10019    Lillian   Haddadi   50032
1      1   10105   Hironoby  Piveteau   61514
2      2   10298   Dietrich   DuCasse   43923
3      3   10684      Aimee  Tokunaga   47683
4      4   11315      Neven   Meriste   85452

In [96]:
max_salary.to_sql('max_salary', engine, if_exists='replace', index=False)

1521

In [97]:
max_salary_3 = pd.read_sql('SELECT * FROM max_salary', engine)
max_salary_3.head()

   emp_no first_name last_name  salary
0   10019    Lillian   Haddadi   50032
1   10105   Hironoby  Piveteau   61514
2   10298   Dietrich   DuCasse   43923
3   10684      Aimee  Tokunaga   47683
4   11315      Neven   Meriste   85452

### `to_sql` appeding table

In [100]:
max_salary_plus = max_salary.copy()
max_salary_plus['salary'] = max_salary_plus['salary'] + 1_000_000

In [101]:
max_salary_plus.to_sql('max_salary', engine, if_exists='append', index=False)

1521

In [102]:
max_salary_4 = pd.read_sql('SELECT * FROM max_salary', engine)
max_salary_4.head()

   emp_no first_name last_name  salary
0   10019    Lillian   Haddadi   50032
1   10105   Hironoby  Piveteau   61514
2   10298   Dietrich   DuCasse   43923
3   10684      Aimee  Tokunaga   47683
4   11315      Neven   Meriste   85452

In [103]:
max_salary_3.shape

(1521, 4)

In [104]:
max_salary_4.shape

(3042, 4)

In [109]:
max_salary['create_date'] = dt.now()

In [110]:
max_salary.to_sql('max_salary', engine, if_exists='replace', index=False)

1521

In [111]:
max_salary_6 = pd.read_sql('SELECT * FROM max_salary', engine)
max_salary_6.head()

   emp_no first_name last_name  salary         create_date
0   10019    Lillian   Haddadi   50032 2023-12-08 16:53:48
1   10105   Hironoby  Piveteau   61514 2023-12-08 16:53:48
2   10298   Dietrich   DuCasse   43923 2023-12-08 16:53:48
3   10684      Aimee  Tokunaga   47683 2023-12-08 16:53:48
4   11315      Neven   Meriste   85452 2023-12-08 16:53:48